app/controllers/wishes_controller.rb

SELECT "wishes".* FROM "wishes"
---
  def index
    @wishes = Wish.all

SELECT "wishes".* FROM "wishes" WHERE "wishes"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @wish = Wish.find(params[:id])